"""
Абстрактные интерфейсы доменных классов Маркова.

Module: markov_algorithms.domain.abstract
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from markov_algorithms.domain.abstract.rule import AbstractRule

# ---------------------------------------------------------------------------
# Public API
# ---------------------------------------------------------------------------

__all__ = ["AbstractRule"]
