"""
Загрузка и сохранение нормального алгорифма Маркова.

Module: markov_algorithms.io
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from markov_algorithms.io.parser import load_algorithm
from markov_algorithms.io.parser import save_algorithm


# ---------------------------------------------------------------------------
# Public API
# ---------------------------------------------------------------------------

__all__ = ["load_algorithm", "save_algorithm"]
