"""
Исключения, связанные с сотрудниками.

Module: common.exceptions.employee_exceptions
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from common.exceptions.base import FactoryError

# ---------------------------------------------------------------------------
# Classes
# ---------------------------------------------------------------------------

class EmployeeNotAvailableError(FactoryError):
    """Сотрудник недоступен (отпуск, больничный)."""
