"""
Исключения, связанные с сотрудниками.

Module: common.exceptions.employee_exceptions
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from common.exceptions.base import FactoryException


# ---------------------------------------------------------------------------
# Classes
# ---------------------------------------------------------------------------

class EmployeeNotAvailableException(FactoryException):
    """Сотрудник недоступен (отпуск, больничный)."""
