"""
Исключения, связанные с оборудованием.

Module: common.exceptions.equipment_exceptions
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from common.exceptions.base import FactoryError

# ---------------------------------------------------------------------------
# Classes
# ---------------------------------------------------------------------------

class EquipmentBrokenError(FactoryError):
    """Оборудование сломано."""


class EquipmentNotAvailableError(FactoryError):
    """Оборудование занято или недоступно."""
