"""
Исключения, связанные с материалами.

Module: common.exceptions.material_exceptions
"""

# ---------------------------------------------------------------------------
# Imports
# ---------------------------------------------------------------------------

from common.exceptions.base import FactoryError

# ---------------------------------------------------------------------------
# Classes
# ---------------------------------------------------------------------------

class InvalidMaterialError(FactoryError):
    """Некорректные данные материала."""


class InsufficientMaterialError(FactoryError):
    """Недостаточно материала на складе."""
